#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

#### stdout
```
module.cluster.data.oci_identity_availability_domains.ads: Reading...
data.oci_secrets_secretbundle.platform_secrets: Reading...
module.network.data.oci_identity_availability_domains.ads: Reading...
module.cluster.data.oci_containerengine_node_pool_option.node_pool_option: Reading...
module.network.oci_core_vcn.platform_vcn: Refreshing state... [id=ocid1.vcn.oc1.phx.amaaaaaawh4wkdqawc7ghbbdukabzuofbcr653wb4gs3bpwuw6lvveupb44q]
module.cluster.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3838085979]
module.network.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3838085979]
module.network.oci_core_network_security_group.platform_nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.phx.aaaaaaaapanmkql2szvhe5wpxafkdrbum55f6pzqrei73iihbot6krcj64oa]
module.network.oci_core_security_list.platform_sl: Refreshing state... [id=ocid1.securitylist.oc1.phx.aaaaaaaa2c74vmkbojbu7wqsd7jmit7iromspk7wgvqbh7sofp7d6xlmcnuq]
module.network.oci_core_internet_gateway.platform_internet_gateway: Refreshing state... [id=ocid1.internetgateway.oc1.phx.aaaaaaaawcapfm64vb53gitubz6aprlqr6lh6cg7lecdgr73nqblwqcw46ra]
data.oci_secrets_secretbundle.platform_secrets: Read complete after 0s [id=SecretsSecretbundleDataSource-2090647088]
module.bootstrap.kubernetes_namespace_v1.cert_manager[0]: Refreshing state... [id=cert-manager]
module.network.oci_core_route_table.platform_rt: Refreshing state... [id=ocid1.routetable.oc1.phx.aaaaaaaas3csebu2673b723nc3xaglpq7h46gv3tejsj7legubonmr7fk62q]
module.network.oci_core_subnet.platform_subnets["10.21.0.0/16"]: Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaa7y7d7vnnp4e3kw52sdfy5zsb5zirkcpasyxq5hajftqjx72vz36q]
module.network.oci_core_subnet.platform_subnets["10.22.0.0/16"]: Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaab6n3cjncs36za2wyjhpktybmone6xyu4uocduiweejtb4krrur3q]
module.network.oci_core_subnet.platform_subnets["10.23.0.0/16"]: Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaajjtws5fom4m4aock3e4hyugsuyz2w25zoymg5xs7rgopysgcfghq]
module.network.oci_core_subnet.platform_subnets["10.20.0.0/16"]: Refreshing state... [id=ocid1.subnet.oc1.phx.aaaaaaaa4nexgog3w25gxj2ehjy5reyq6smi3ktvvnweia4nc2x4gddxqnla]
module.cluster.oci_containerengine_cluster.platform_cluster: Refreshing state... [id=ocid1.cluster.oc1.phx.aaaaaaaa7avw4ej27n6uxmvfmfhhlzvnwlgtno6yum3fx2t2rc7fv6q6klra]
module.bootstrap.kubernetes_secret_v1.cert_manager_cloudflare_api_token[0]: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
module.cluster.data.oci_containerengine_node_pool_option.node_pool_option: Read complete after 1s [id=ContainerengineNodePoolOptionDataSource-1870923232]
module.cluster.oci_containerengine_node_pool.platform_nodepool_b: Refreshing state... [id=ocid1.nodepool.oc1.phx.aaaaaaaaegfnyesr7agclshojxp2ibsjku5gt6hv2ksviuiprn4xijqqd4kq]
module.cluster.oci_containerengine_node_pool.platform_nodepool_a: Refreshing state... [id=ocid1.nodepool.oc1.phx.aaaaaaaajfsvv46zdrkkw4whndsx66gdskygttu5sycetlea3nbrkq2n6whq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_objectstorage_bucket.metrics-bucket will be created
  + resource "oci_objectstorage_bucket" "metrics-bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "nsc-metrics-bucket"
      + namespace                    = "axgi7clmxnue"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

  # module.bootstrap.helm_release.argo_cd will be created
  + resource "helm_release" "argo_cd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argo-cd"
      + namespace                  = "argo-cd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                configs: 
                  repositories:
                    nsc-helm: 
                      name: "Network Sanitation Committee Github Helm Repository"
                      type: "helm"
                      url: "https://raw.githubusercontent.com/NetworkSanitationCommittee/charts/main"
                      #username: NotRealPAT
                      #password: NotRealPAT
                
                controller:
                  logLevel: error
                  args:
                    appResyncPeriod: "30"
                  extraArgs:
                    - --app-state-cache-expiration=1s
                    - --default-cache-expiration=1s
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                  resources:
                    requests:
                      cpu: 300m
                      memory: 750Mi
                
                dex:
                  # disable dex for now because we don't do authentication to argocd at all
                  enabled: false
                
                redis:
                  metrics:
                    enabled: true
                    image:
                      # specify docker registry because the quay default doesn't work
                      repository: bitnami/redis-exporter
                    serviceMonitor:
                      enabled: true
                  resources:
                    requests:
                      cpu: 10m
                      memory: 64Mi
                
                server:
                  logLevel: error
                  config:
                    timeout.reconciliation: 30s
                  extraArgs:
                    - --app-state-cache-expiration=1s
                    - --default-cache-expiration=1s
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                  resources:
                    requests:
                      cpu: 10m
                      memory: 64Mi
                
                repoServer:
                  logLevel: error
                  extraArgs:
                    - --repo-cache-expiration=1s
                    - --default-cache-expiration=1s
                    - --revision-cache-expiration=1s
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                  resources:
                    requests:
                      cpu: 300m
                      memory: 750Mi
                
                applicationSet:
                  # disable the applicationSet controller because we don't use it and it ends
                  # up in a crashloop due to cache syncing timeouts
                  enabled: false
            EOT,
        ]
      + verify                     = false
      + version                    = "4.9.12"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # module.bootstrap.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "kube-prometheus-stack"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                grafana:
                  enabled: false
                # disable monitoring of kube-controller-manager, kube-proxy, kube-scheduler,
                # because they are managed by the cloud vendor
                defaultRules:
                  rules:
                    kubeProxy: false
                    kubeScheduler: false
                kubeControllerManager:
                  enabled: false
                kubeProxy:
                  enabled: false
                kubeScheduler:
                  enabled: false
                prometheus:
                  prometheusSpec:
                    retention: 10d
                    retentionSize: "18GB" # 90% of max storage
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          storageClassName: encrypted-gp2
                          resources:
                            requests:
                              storage: 20Gi
                    resources:
                      requests:
                        cpu: 250m
                        memory: 1.5Gi
                      limits:
                        cpu: 500m
                        memory: 1.5Gi
                    # allow service monitors to be selected from all namespaces and labels
                    serviceMonitorSelectorNilUsesHelmValues: false
                    externalLabels:
                      cluster: everything
                    remoteWrite:
                      - url: http://cortex-nginx.cortex.svc.cluster.local/api/v1/push
                        basicAuth:
                          username:
                            name: prometheus-remote-write-basic-auth
                            key: username
                          password: 
                            name: prometheus-remote-write-basic-auth
                            key: password
            EOT,
        ]
      + verify                     = false
      + version                    = "33.1.0"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # module.bootstrap.module.platform_services[0].kubectl_manifest.application will be created
  + resource "kubectl_manifest" "application" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "platform-services"
      + namespace               = "argo-cd"
      + sensitive_fields        = [
          + "spec.source.helm.values",
        ]
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              name: platform-services
              namespace: argo-cd
            spec:
              destination:
                namespace: argo-cd
                server: https://kubernetes.default.svc
              project: default
              source:
                chart: platform-services
                helm:
                  values: (sensitive value)
                  version: v3
                repoURL: https://raw.githubusercontent.com/catalystsquad/charts/main
                targetRevision: '>=1.0.0-alpha'
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
                retry:
                  backoff:
                    duration: 5s
                    factor: 2
                    maxDuration: 3m
                  limit: 3
                syncOptions:
                - CreateNamespace=true
                - PrunePropagationPolicy=foreground
                - PruneLast=true
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

#### stderr
```

```

</details>

*Action: `pull_request`, Working Directory: `everything`, Workflow: `Validate pull request`*